Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/working_abroad/working_in_the_eu.html.txt.tmx
Source language: en
Languages: ga

source: If you comply with the rules of the profession or trade that apply in your own country, you can, in principle, offer those services anywhere else in the EU
ga: Má shásaíonn tú na rialacha a bhaineann leis an ngairm nó ceird atá leagtha síos i do thír féin, is féidir leat, i bprionsabal, na seirbhísí sin a chur ar fáil in aon áit eile san AE

source: You can travel to assist clients located in another EU country or you can provide paid services from your country of residence without travelling there
ga: Is féidir leat taisteal le cúnamh a thabhairt do chustaiméirí atá lonnaithe i dtír eile den AE nó is féidir leat seirbhísí a chur ar fáil ar íocaíocht ó do thír chónaithe féin gan taisteal ar chor ar bith chuig an tír eile

source: You are a cross-border commuter (also known as a cross-border or frontier worker) if you live in one EU country but work in another and you go home at least once a week
ga: Is comaitéir trasteorainn thú má chónaíonn tú i dtír amháin den AE agus má oibríonn tú i gceann eile ach má fhilleann tú ar an mbaile ar a laghad uair sa tseachtain

source: As a cross-border worker, you must be treated in the same way as an employee who is a national of the country of employment as regards the right to apply for jobs, working conditions and social benefits
ga: Mar oibrí trasteorainn ní mór caitheamh leat ar an mbealach céanna le fostaí gur saoránach den tír ina bhfuil sé/sí fostaithe maidir le cearta iarratais a dhéanamh ar phostanna, coinníollacha oibre agus sochair shóisialta

source: Therefore, the general rule is that you pay social security contributions in the member state where you are employed and you are subject to the legislation of that state even if you live in another member state
ga: Mar sin, go ginearálta íocann tú ranníocaíochtaí árachais shóisialaigh leis an mballstát ina bhfuil tú fostaithe agus baineann an reachtaíocht sa stát sin leat fiú má chónaíonn tú i mballstát eile

source: With regard to benefits, generally you get short-term benefits from the state where you last paid insurance and long-term benefits proportionately from all the countries in which you paid insurance
ga: Maidir le sochair, go ginearálta faigheann tú sochair ghearr-théarmacha ón Stát inár íoc tú árachas go deireanach agus sochair fhad-théarmacha i gcomhréir ó na tíortha uilig ina raibh tú ag íoc árachais iontu

source: For cross-border workers, the rule in relation to unemployment benefit is as follows:
ga: Seo a leanas na rialacha a bhaineann le sochair dífhostaíochta do chomaitéirí trasteorainn:

source: • During partial or intermittent unemployment you get your benefit from the country of employment
ga: • Más tréimhse dífhostaíochta páirt-aimseartha nó sealadach atá i gceist íocann an tír ina bhfuil tú ag obair inti sochar dífhostaíochta leat

source: • During periods of being wholly unemployed, you get your benefit from the country of residence
ga: • Más tréimhse dífhostaithe fadthéarmach atá i gceist íocann an tír ina chónaíonn tú sochar dífhostaíochta leat

source: So, for example, if you are living in the State and working in Northern Ireland you can claim Jobseeker’s Benefit from your local social welfare office or Intreo centre, if you lose your job
ga: Mar shampla, má tá tú i do chónaí sa Stát, ag obair i dTuaisceart na hÉireann agus má chailleann tú do phost, is féidir iarratas ar Shochar Cuardaitheora Poist do d’oifig leasa shóisialaigh áitiúil nó d’ionad Intreo a dhéanamh

source: If you are employed or self-employed in 2 member states, you pay social security contributions in the state where you live
ga: Má tá tú fostaithe nó féin-fhostaithe i 2 bhallstáit, is féidir leat ranníocaíochtaí árachais shóisialaigh a íoc sa tír ina bhfuil cónaí ort inti

source: The Border People website is a source of information for people living in the border counties of Ireland and elsewhere in the island of Ireland
ga: Is an suíomh gréasáin Border People é foinse faisnéise do dhaoine atá ina gcónaí sna contaetha trasteorann na hÉireann agus in áit eile san oileán Éireann

source: It provides cross-border mobility information on taxation, social security and job seeking, health and education as well as banking, housing and telecommunications
ga: Soláthraíonn sé faisnéis soghluaisteachta trasteorann maidir le cáin, slándáil shóisialach agus lorg oibre, sláinte agus oideachas, chomh maith le baincéireacht, tithíocht agus teileachumarsáide

source: The information is about rights and entitlements in Northern Ireland and Ireland with sections about living, working and studying both north and south of the border
ga: Tá an fhaisnéis le haghaidh cearta agus teidlíochtaí i dTuaisceart Éireann agus in Éirinn agus tá rannáin maidir le cónaí, obair agus staidéir sa tuaisceart agus sa deisceart an teorainn

source: There is also a list of frequently asked questions on topics such as motoring, employment, tax, healthcare, consumer and social welfare
ga: Tá liosta ceisteanna coitianta freisin faoi ábhair, mar shampla, gluaisteánaíocht, fostaíocht, cáin, cúram sláinte, tomhaltóirí agus leas sóisialach

source: For information about your rights in the European Union you can contact:
ga: Chun faisnéis faoi do chearta san AE a fháil, is féidir dul i dteagmháil le:

source: European Commission Representation in Ireland
ga: Oifig an Choimisiúin Eorpaigh in Éirinn

source: Tel:+353 1 634 1111
ga: Teil:+353 1 634 1111

source: Fax:+353 1 634 1112
ga: Facs:+353 1 634 1112

source: You are a posted worker if your employer sends you to work in another country on a temporary basis
ga: Má chuireann d’fhostóir in Éirinn thú ag obair go sealadach i dtír eile den LEE, tugtar oibrí sannta ort

source: The period of the posting is a maximum period of 24 months
ga: Tá an tréimhse sannta suas le 24 mhí (12 mhí roimhe seo)

source: If you are posted to another EEA state or Switzerland you have certain rights as follows:
ga: Má shanntar chuig tír eile den LEE nó Eilvéis tá teidlíochtaí áirithe agat mar a leanas:

source: As a posted worker you generally will continue to pay your social security contributions in Ireland
ga: Má oibrí sannta thú, de ghnáth leanfaidh tú do chuid ranníocaíochtaí slándála sóisialaí in Éirinn a íoc

source: You should apply for an A1 (formerly E101) certificate which states that you are insured for social security purposes in Ireland
ga: Ba chóir duit iarratas a dhéanamh ar theastas A1 (E101 roimhe seo) a sonraíonn go bhfuil tú clúdaithe faoi árachas sóisialach in Éirinn

source: This will exempt you and your employer from paying social insurance in the country to which you are posted
ga: Beidh tú agus d’fhostóír díolmhaithe ó árachas sóisialach a íoc sa tír in atá tú sannta

source: At least 4 weeks before you leave you or your employer should apply for the AI certificate
ga: Caithfidh tú ó d’fhostóir iarratas a dhéanamh ar theastas A1 4 seachtain roimh d’imeacht ar a laghad

source: You can download the application form for an A1 (pdf) and it is also available from the PRSI Special Collections Section of the Department of Social Protection (DSP)
ga: Tá an fhoirm iarratais ar fáil anseo (pdf) agus ón Rannóg Bailithe Speisialta ÁSPC den Roinn Coimirce Sóisialaí (RCS)

source: When you get the A1 certificate you will continue to pay your PRSI contributions in Ireland
ga: Nuair a fhaigheann tú an teastas A1, leanfaidh tú do ranníocaíochtaí ÁSPC in Éirinn a íoc

source: There are further details about PRSI and posted workers on the DSP website
ga: Tá níos mó sonraí faoi oibrithe sannta agus ÁSPC ar an suíomh gréasáin RCS

source: The European Health Insurance Card (EHIC) replaced forms such as the E111 and the E128, making it easier for you to get medical care quickly and easily
ga: Tháinig Cárta Eorpach Árachas Sláinte (CEAS) in ionad an E111 agus an E128 agus cóir leighis le fáil thapa na córa leighis a éascú duit

source: It is evidence that you are part of a health insurance scheme administered by another state in the EEA/Switzerland
ga: B’fhianaise í gur bhall de scéim árachais sláinte tú atá á riar ag stát éigin eile sa LEE nó Eilvéis

source: An S1 portable document (formerly E106) ensures that you have the same health entitlements in the state to which you are being posted, as are available to nationals of that state
ga: Áiritheoidh an S1 doiciméad iniompartha (E106 roimhe seo) go mbeidh na teidlíochtaí céanna agat sa stát ina seoltar thú, mar atá ar fáil do náisiúnach den stát sin

source: Before you go to another EU state, you should contact your Local Health Office to obtain an S1
ga: Sula dtéann tú go stát AE eile, ba chóir duit dul i dteagmháil le d'Oifig Áitiúil Sláinte chun S1 a fháil
